app/controllers/employee_controller.rb

  def register()
    params[:code].upcase!
#    params[:name] = params[:name].titlecase
    params[:name] = params[:name].titlecase
    employee  = Employee.find_by_code(params[:code])
    if employee.nil?
      employee = Employee.create(:code  => params[:code], :name => params[:name])
    else
      employee.name = params[:name]
      employee.save!
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`code` = 'K0075' LIMIT 1
INSERT INTO `employees` (`code`, `created_at`, `name`, `updated_at`) VALUES (?, ?, ?, ?)  [["code", "K0075"], ["created_at", Tue, 07 Apr 2015 14:37:43 IST +05:30], ["name", "Anoop M"], ["updated_at", Tue, 07 Apr 2015 14:37:43 IST +05:30]]
UPDATE `employees` SET `name` = ?, `updated_at` = ? WHERE `employees`.`id` = 4  [["name", "Sachin Tendulkar"], ["updated_at", Tue, 07 Apr 2015 14:42:46 IST +05:30]]

  def get()
      record = Employee.find_by_code(params[:id])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`code` = 'J0075' LIMIT 1