app/controllers/mark_controller.rb

  def add
    params.require(:code)
    params.require(:ts)
    params.require(:mode)

    params[:code].upcase!
    employee = Employee.find_by_code(params[:code])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`code` = 'J0075' LIMIT 1